/**-------------文件信息--------------------------------------------------------------------------------
**文   件   名: SPI.c
**创   建   人: 程莺红
**修   改   人: 
**最后修改日期: 2006年3月31日
**最 新 版  本: V1.2
**描        述: 初始化SPI总线，发送数据位
				
**
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: 程莺红 
** 版  本: V1.2
** 日　期: 2006年3月31日
** 描　述: 原始版本
**
********************************************************************************************************/
#include <reg938.h>
#include <SPI.h>
 /*
*********************************************************************************************************
*                         SPI初始化
*
* Description: SPI初始化
*
* Arguments  : 无
*
* Returns    : 无
*********************************************************************************************************
*/
void InitSPI()
{
	//SPCTL = 0x50;		//SSIG=0,SPEN=0,MSTR=0，SPI被禁止，作为普通I/O口	
	SPCTL = 0x00;
}

/*
*********************************************************************************************************
*                         发送数据
*
* Description: SPI发送一个字节的数据
*
* Arguments  : send_byte是SPI设置字                ------错
*
* Returns    : 无
*********************************************************************************************************
*/
void MSend_bit(unsigned int send_data,unsigned char Bitcnt)
{
	unsigned char  i;
	unsigned int  trans_data;
	for(i=0;i<Bitcnt;i++)
	{
		trans_data = send_data;
		if((trans_data&=0x8000)==0)
		{
			DATA = 0;
		}			
		else
		{
			DATA = 1;	
		}
		CLK = 1;
		CLK = 0;
		send_data <<= 1;
	}		
}																					  