
/**-------------文件信息--------------------------------------------------------------------------------
**文   件   名: cpu.c
**创   建   人: 程莺红
**修   改   人: 
**最后修改日期: 2006年3月31日
**最 新 版  本: V1.2
**描        述: 完成cpu的I/O口以及看门够、中断等的初始化
**
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: 程莺红 
** 版  本: V1.2
** 日　期: 2006年3月31日
** 描　述: 原始版本
**
********************************************************************************************************/
#include <reg938.h>
#include <timer.h>
#include <I2C.h>

/*
*********************************************************************************************************
*                         初始化系统信息
*
* Description: 初始化系统/IO口，中断开启
*
* Arguments  : 无
* Returns    : 无
*********************************************************************************************************
*/
void InitCpu(void)
{
						// PORT		Configuration	FUNC				P0M1		P0M2
	P0M1 = 0x07;		// P0.0	---	仅为输入-------	Pacurrent---------	1			0	
	P0M2 = 0xC8;		// P0.1		仅为输入		PAout     			1			0
						// P0.2	---	仅为输入-------	PAref --------------1			0
						// P0.3		推挽输出------ost-------------------0			1				
						// P0.4	---	准双向口-------	PDA-----------------0			0
						// P0.5		准双向口		PCL					0			0
						// P0.6	---	推挽输出-------	LD   ---------------0			1
						// P0.7		推挽输出		RDE					0			1

						// PORT		Configuration	FUNC				P1M1		P1M2
	P1M1 = 0x2E;		// P1.0	---	推挽输出-------	TXD	---------------	0----------	1	
	P1M2 = 0x9D;		// P1.1		仅为输入		RXD					1			0
						// P1.2	---	开漏输出-------	SCL	---------------	1----------	1
						// P1.3		开漏输出		SDA					1			1
						// P1.4	---	推挽输出-------	WP  -------------	0----------	1
						// P1.5		仅为输入		RST					1			0
						// P1.6	---	准双向口-------	空闲  ------------- 0----------	0
						// P1.7		推挽输出		RFswitch 			0			1

						// PORT		Configuration	FUNC				P2M1		P2M2
	P2M1 = 0x0A;		// P2.0	---	准双向口------- 空闲------------	0----------	0	
	P2M2 = 0xf4;		// P2.1		仅为输入		LimYes 		    	1			0
						// P2.2	---	推挽输出-------	LD2 ------------	0----------	1
						// P2.3		仅为输入		LockYes	 			1			0
						// P2.4	---	推挽输出-------	DATA------------	0----------	1
						// P2.5		推挽输出		CLK					0			1
						// P2.6	---	推挽输出	----	v3.3c  ------------	0----------1
						// P2.7		准双向口	    空闲 			    0			1

						// PORT		Configuration	FUNC				P3M1		P3M2
	P3M1 = 0x02;		// P3.0	---	推挽输出-------	XTAL2 --------------0----------	1	
	P3M2 = 0x01;		// P3.1		仅为输入		XTAL1				1			0


	 
	ACC = WDCON; 		//读取WDT控制寄存器 
	ACC = ACC|0x04; 	//置位ACC.2准备启动WDT 
	WDL = 0xFF; 		//设置8位倒计时器初值 
	WDCON = ACC; 		//启动WDT 
	WFEED1 = 0xA5; 		//清零第一部分 
	WFEED2 = 0x5A; 		//清零第二部分 
 
	 
	  
	WP = 1;				//打开写保护，芯片只能读不能写
   	EA = 1;	

}
