/**-------------文件信息--------------------------------------------------------------------------------
**文   件   名: timer.c
**创   建   人: 程莺红
**修   改   人: 
**最后修改日期: 2006年3月31日
**最 新 版  本: V1.2
**描        述: 完成定时器的初始化，中断响应以及系统时钟计时
**
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: 程莺红 
** 版  本: V1.2
** 日　期: 2006年3月31日
** 描　述: 原始版本
**
********************************************************************************************************/

#include <reg938.h>
#include <timer.h>
							
static unsigned short sysTime = 0L;
//static unsigned char softTimerCnt = 0;

/*
*********************************************************************************************************
*                         初始化定时器
*
* Description: 初始化定时工作模式以及初始值
*
* Arguments  : 无
* Returns    : 无
*********************************************************************************************************
*/
void InitTimer1()
{
	TMOD = 0x10;

    TH1 = 0x28;    
    TL1 = 0x00;
	
	ET1 = 1;
    TR1 = 1;

}

/*
*********************************************************************************************************
*                         定时器值重装
*
* Description: 定时中断，定时器溢出重装
*
* Arguments  : 无
* Returns    : 无
*********************************************************************************************************
*/
void Timer1( void ) interrupt 3 
{
	TR1 = 0;
    TH1 = 0x28;    	  	//定时器初始值， 定时为5ms
    TL1 = 0x00;
 	EA=0 ;
 	sysTime++;
	PktHandle2S_time++; //数据处理定时器加1
	EA=1 ;
	TR1 = 1;
	
	//以下回调函数必须放在TR=1后，因为TimerCallback耗时，影响计数精度。
	if(TimerCallback != (void*)0)
		TimerCallback();	
}
/*
*********************************************************************************************************
*                         获取系统时间
*
* Description: 取得系统时间
*
* Arguments  : 无
* Returns    : ticks
*********************************************************************************************************
*/
unsigned short getTime() small
{
	unsigned short  ticks;	

	EA = 0;;
	ticks = sysTime;
	EA = 1;
					
	return (ticks);
}